python/setfile.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="%domain%">
            <dp:set-file name="%filename%">%b64file%</dp:set-file>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>
